/*

    Задание 4:

    Написать компонент который сгенерирует табличку 50х50 элементов.

    Каждая ячейка является отдельным компонентом инпутом, в который можно вбить информацию. 
    Весь массив данных храниться в исходном компоненте в котором происходит генерация.

    Все элементы должны быть оптимизированы с использованием ключей и React.memo.
    Главное условие: 
    - При изменении информации в ячейке, должна перерисовываться только она. 
        Остальные элементы не должны быть затронуты.

*/