/*

    Используя хуки написать компонент, который будет работать с Controlled формой следующего формата:
    
    1. UserName = text
    2) Email = email
    3) City = select (Kyiv, Lviv, Harkiv, Odesa )
    4) Type = Компонент Toogle с предыдущих занятий
    
    После нажатия на Enter или кнопки "Отправить", скрипт должен создать под формой в списке элемент в
    котором будут указаны все вышеуказанные поля.
    Сами же поля в компоненте должны быть очищены после добавления нового элемента.
    Все поля обязательные.
    
*/
